int a = 1;
int b = 3;
int c = 10;
int d = 2;


/*
1. Написать программу, вычисляющую выражение a * (b + (c / d)) и выводящую результат с плавающей точкой, где a, b, c, d
– целочисленные константы. Используйте static_cast или СStyle cast к float чтобы выполнить точное деление.

2. Дано целое число. Если оно меньше или равно 21, то
выведите на экран разницу между этим числом и числом 21.
Если же заданное число больше, чем 21, необходимо вывести
удвоенную разницу между этим числом и 21. При выполнении
задания следует использовать тернарный оператор (?:).

3. * Описать трёхмерный целочисленный массив, размером
3х3х3 и указатель на значения внутри массива и при помощи
операции разыменования вывести на экран значение
центральной ячейки получившегося куба [1][1][1].
*/